Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTooFarRefs Property
 Structural Connection Handler cannot connect too far elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionTooFarRefs { get; }
Public Shared ReadOnly Property StructuralConnectionTooFarRefs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionTooFarRefs {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionTooFarRefs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace